<template>
  <div class="row justify-content-center text-center">
    <div style="margin-top: 117px">
      <h4 class="h4 animate__animated animate__fadeInUpBig animate__delay-2s">
        الوصول السريع
      </h4>
    </div>
    <div class="row justify-content-center mt-4">
      <div
        class="col-6 col-md-3 col-lg-2 animate__animated animate__fadeInRight animate__delay-2s"
      >
        <div class="row">
          <div class="col-1">
            <div class="circle">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="19.681"
                height="19.681"
                viewBox="0 0 19.681 19.681"
              >
                <path
                  id="icons8_more_info"
                  d="M11.946,2a5.367,5.367,0,1,0,5.367,5.367A5.378,5.378,0,0,0,11.946,2Zm0,10.735A8.963,8.963,0,0,0,3,21.681H4.789a7.157,7.157,0,1,1,14.313,0h1.789A8.963,8.963,0,0,0,11.946,12.735ZM20.892,2V3.789h1.789V2ZM11.946,3.789A3.578,3.578,0,1,1,8.367,7.367,3.567,3.567,0,0,1,11.946,3.789Zm8.946,1.789v5.367h1.789V5.578Z"
                  transform="translate(-3 -2)"
                  fill="#fff"
                />
              </svg>
            </div>
          </div>
          <div class="col-1 divmagright">
            <p>الشكاوى والاستفسارات</p>
          </div>
        </div>
      </div>
      <div
        class="col-6 col-md-3 col-lg-2 animate__animated animate__fadeInRight animate__delay-2s"
      >
        <div class="row">
          <div class="col-1">
            <div class="circle">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="25.395"
                height="21.469"
                viewBox="0 0 25.395 21.469"
              >
                <path
                  id="icons8_service"
                  d="M18.892,2V4.167a4.524,4.524,0,0,0-2.457,1.041c-.017.019-.008.05-.024.07L15.586,4.8l-.776-.447-.895,1.552.776.447,1.09.629c-.129.443-.468.821-.468,1.279s.339.836.468,1.279l-1.09.629-.776.447.895,1.552.776-.447.825-.475c.017.02.007.05.024.07a4.524,4.524,0,0,0,2.457,1.041v2.167h1.789V12.358a4.524,4.524,0,0,0,2.457-1.041c.017-.019.008-.05.025-.07l.825.475.776.447.895-1.552-.776-.447-1.09-.629c.129-.443.468-.821.468-1.279s-.339-.836-.468-1.279l1.09-.629.776-.447-.895-1.552-.776.447-.825.475c-.017-.02-.007-.05-.025-.07a4.524,4.524,0,0,0-2.457-1.041V2Zm.895,3.578A2.515,2.515,0,0,1,21.8,6.4a2.943,2.943,0,0,1,0,3.732,2.515,2.515,0,0,1-2.016.818,2.515,2.515,0,0,1-2.016-.818,2.943,2.943,0,0,1,0-3.732A2.515,2.515,0,0,1,19.787,5.578ZM8.157,12.735A9.778,9.778,0,0,0,6.113,13a.894.894,0,0,0-.094.028L1.6,14.573A.9.9,0,0,0,1.046,15.7l1.789,5.367a.895.895,0,0,0,1.181.549l4.1-1.642,5.682,2.8-.1-.056a4.479,4.479,0,0,0,4.4.315.9.9,0,0,0,.119-.066l7.44-5.021.741-.5-1-1.482-.741.5-7.342,4.952a2.679,2.679,0,0,1-2.621-.189.9.9,0,0,0-.1-.056L8.552,18.193a.9.9,0,0,0-.727-.028L4.233,19.6,3.024,15.971l3.529-1.234a9.647,9.647,0,0,1,1.6-.213,2.758,2.758,0,0,1,2.132.7,17.279,17.279,0,0,0,3.264,2.4c1.05.464,2.2.5,4.455.475l.895-.011L18.881,16.3l-.895.01c-2.218.029-3.081-.044-3.708-.321a20.2,20.2,0,0,1-2.886-2.17A4.961,4.961,0,0,0,8.157,12.735Z"
                  transform="translate(-0.999 -2)"
                  fill="#fff"
                />
              </svg>
            </div>
          </div>
          <div class="col-1 divmagright">
            <p>الخدمات الإلكترونية</p>
          </div>
        </div>
      </div>
      <div
        class="col-6 col-md-3 col-lg-2 animate__animated animate__fadeInLeft animate__delay-2s"
      >
        <div class="row">
          <div class="col-1">
            <div class="circle">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="26.837"
                height="19.681"
                viewBox="0 0 26.837 19.681"
              >
                <path
                  id="icons8_user_manual"
                  d="M7.157,2A13.721,13.721,0,0,0,.412,3.929L0,4.195V21.681H26.837V4.195l-.412-.266A13.721,13.721,0,0,0,19.681,2a9,9,0,0,0-6.262,2.5A9,9,0,0,0,7.157,2Zm0,1.789a6.958,6.958,0,0,1,5.367,2.195v13.8A8.762,8.762,0,0,0,7.157,18.1a12.976,12.976,0,0,0-5.367,1.237V5.243A10.889,10.889,0,0,1,7.157,3.789Zm12.524,0a10.889,10.889,0,0,1,5.367,1.454v14.1A12.976,12.976,0,0,0,19.681,18.1a8.762,8.762,0,0,0-5.367,1.677V5.984A6.958,6.958,0,0,1,19.681,3.789Zm.895,1.789a.895.895,0,1,0,.895.895A.892.892,0,0,0,20.575,5.578ZM17.892,9.157v1.789h1.789v5.367H21.47V9.157Z"
                  transform="translate(0 -2)"
                  fill="#fff"
                />
              </svg>
            </div>
          </div>
          <div class="col-1 divmagright">
            <p>دليل المعاملات</p>
          </div>
        </div>
      </div>
      <div
        class="col-6 col-md-3 col-lg-2 animate__animated animate__fadeInLeft animate__delay-2s"
      >
        <div class="row">
          <div class="col-1">
            <div class="circle">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="23.259"
                height="23.238"
                viewBox="0 0 23.259 23.238"
              >
                <path
                  id="icons8_statistics"
                  d="M11.735,1V2.789H3.684A2.693,2.693,0,0,0,1,5.473V16.208a2.693,2.693,0,0,0,2.684,2.684h8.051v1.971L4.606,22.491,5,24.238l7.632-1.74,7.632,1.74.391-1.747-7.129-1.628V18.892h8.051a2.693,2.693,0,0,0,2.684-2.684V5.473a2.693,2.693,0,0,0-2.684-2.684H13.524V1ZM3.684,4.578H21.575a.883.883,0,0,1,.895.895V16.208a.883.883,0,0,1-.895.895H3.684a.883.883,0,0,1-.895-.895V5.473A.883.883,0,0,1,3.684,4.578ZM17.109,6.773,12.588,11.12,9.023,8.178,4.648,12.2l1.2,1.314,3.229-2.963,3.592,2.963,4.515-4.333,2.243,1.9,1.16-1.37Z"
                  transform="translate(-1 -1)"
                  fill="#fff"
                />
              </svg>
            </div>
          </div>
          <div class="col-1 divmagright">
            <p>مشاريع البلدية</p>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Row2",
};
</script>

<style>
.circle {
  height: 50px;
  width: 50px;
  background-color: #3ec4b5;
  border-radius: 50%;
}

.col-1 svg {
  margin: 12px;
}
</style>
