<template>
  <div>
    <h3>تطور السكان</h3>
    <p>
      مدينة ساحلية فلسطينية، وأكبر مدن قطاع غزة وتقع في شماله، في الطرف الجنوبي
      للساحل الشرقي من البحر المتوسط. تبعد عن مدينة القدس مسافة 78 كم إلى الجنوب
      الغربي، وهي مركز محافظة غزة وأكبر مدن السلطة الفلسطينية من حيث تعداد
      السكان، حيث بلغ عدد سكان محافظة غزة 700 ألف نسمة في عام 2013، ما يجعلها
      أكبر تجمع للفلسطينيين في فلسطين
    </p>
    <p>تبلغ مساحتها 56 كم2، مما يجعلها من أكثر المدن كثافة بالسكان في العالم</p>
    <p>
      تعتبر مدينة غزة من أهم المدن الفلسطينية، لأهمية موقعها الاستراتيجي
      والأهمية الاقتصادية والعمرانية للمدينة، بالإضافة إلى كونها المقر المؤقت
      للسلطة الوطنية الفلسطينية، ووجود الكثير من مقراتها ووزارتها فيها
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style></style>
